 [𝓪𝓽𝓪𝓫𝓸𝓸𝓴](https://probablyyakov.atabook.org/) 𝓔 [𝓹𝓪𝓽𝓻𝓮𝓸𝓷](https://www.patreon.com/c/KNlGHTOFTHELAKE) 𝓔 [𝓹𝓻𝓸𝓷𝓸𝓾𝓷𝓼](https://pronouns.cc/@knightofthelake) 𝓔 [𝓼𝓽𝓻𝓪𝔀𝓹𝓪𝓰𝓮](https://knlghtofthelake.straw.page/) ᝰ.ᐟ



>  <img src="2363559_884a9.gif" 
 width="55" height="55">
> 𝐀𝐧𝐝 𝐭𝐡𝐞 𝐣𝐨𝐲 𝐟𝐥𝐚𝐬𝐡𝐞𝐝 𝐢𝐧 𝐋𝐚𝐧𝐜𝐞𝐥𝐨𝐭'𝐬 𝐮𝐠𝐥𝐲 𝐟𝐚𝐜𝐞 𝐥𝐢𝐤𝐞 𝐚 𝐛𝐫𝐢𝐠𝐡𝐭 𝐛𝐥𝐚𝐝𝐞 𝐝𝐫𝐚𝐰𝐧 𝐟𝐫𝐨𝐦 𝐚 𝐛𝐚𝐭𝐭𝐞𝐫𝐞𝐝 𝐬𝐡𝐞𝐚𝐭𝐡.
.　　　　　　　　⠀⠀⠀✦ ⠀ ⠀　　　　　　　　　　　　　　⠀⠀⠀⠀⠀* ⠀⠀       ⠀.　　　　　　　　　　. 
![jorking off rn](83d698a79815d3886067062279f2c535.gif)　　　　　　　　　　　　　.　　　ﾟ .　　　　　　　　　　　　　. 　　　　　　　　　　　　　　　✦ 　　　　　,　　　　　　　.
![goes insane](Untitled104_20250919222914_2-removebg-preview.png)
>　　　　　　*　　　　　　　　　　　.
>.　　　　　　　　　　　　　. 　　✦⠀　   　　　,　　　　　　　　　*
![tung tung tung sahur](f1edfd8e109b244610689d459902319f.gif)
　　　　　　*⠀　　⠀  　　　　　⠀✦⠀　
　　　　　　　　　　　　　　　　　　　　　　.
best viewed on mobile ★ <img src="lobo-03.gif" width="55" height="55">
